#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/alexandre3gomes/finances/runs/run-uVp2coRQjr2HwoqT

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:587176767245:certificate/0913acf2-4a9e-4fde-85bf-dea44a8b69a7]
aws_apigatewayv2_api.finances-api: Refreshing state... [id=bztdahtqn8]
aws_cloudfront_origin_access_identity.app-origin-identity: Refreshing state... [id=EI9BMVI3YOJVM]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-1:587176767245:certificate/c29045d2-7f99-46c2-a7b7-63b9a3b06c6e]
data.aws_iam_policy_document.policy_ec2_assume: Reading...
data.aws_iam_policy_document.policy_service_allow: Reading...
aws_s3_bucket.app: Refreshing state... [id=finances-app20220810000607428700000004]
aws_default_vpc.primary: Refreshing state... [id=vpc-0293e7cbc771ba51b]
aws_s3_bucket.artificats: Refreshing state... [id=artificats20220810000607428400000003]
aws_route53_zone.primary: Refreshing state... [id=Z101963012JKD45NDFGLP]
data.aws_iam_policy_document.policy_ec2_assume: Read complete after 0s [id=1903849331]
data.aws_iam_policy_document.policy_service_allow: Read complete after 0s [id=3074029395]
aws_iam_role.beanstalk-role: Refreshing state... [id=aws-elasticbeanstalk-ec2-role]
aws_iam_role.application-service-role: Refreshing state... [id=aws-elasticbeanstalk-service-role]
aws_route53_record.app_validation["finances-easy.co.uk"]: Refreshing state... [id=Z101963012JKD45NDFGLP__bfe4c445de567ac98e890e38a846b964.finances-easy.co.uk._CNAME]
aws_apigatewayv2_stage.api-stage: Refreshing state... [id=prod]
aws_route53_record.api_validation["api.finances-easy.co.uk"]: Refreshing state... [id=Z101963012JKD45NDFGLP__27e0380d9f00f18ef4235494bd5485a0.api.finances-easy.co.uk_CNAME]
aws_apigatewayv2_domain_name.finances-domain: Refreshing state... [id=api.finances-easy.co.uk]
aws_elastic_beanstalk_application.api: Refreshing state... [id=finances-easy-api]
aws_iam_instance_profile.beanstalk-instance-profile: Refreshing state... [id=aws-elasticbeanstalk-instance-profile]
aws_route53_record.api-record: Refreshing state... [id=Z101963012JKD45NDFGLP_api.finances-easy.co.uk_A]
aws_security_group.api-sg: Refreshing state... [id=sg-0b9d45f4fd702aeeb]
aws_apigatewayv2_api_mapping.finances-mapping: Refreshing state... [id=qdhp43]
aws_security_group.db-sg: Refreshing state... [id=sg-0d4da7ca73e7bd71d]
aws_db_instance.finances-rds: Refreshing state... [id=finances-db]
aws_elastic_beanstalk_application_version.api-source: Refreshing state... [id=finances-easy-api]
aws_s3_bucket_public_access_block.artifacts-public-policy: Refreshing state... [id=artificats20220810000607428400000003]
data.aws_iam_policy_document.cloudfront-access-policy: Reading...
aws_s3_bucket_public_access_block.app-public-policy: Refreshing state... [id=finances-app20220810000607428700000004]
aws_s3_bucket_website_configuration.app-config: Refreshing state... [id=finances-app20220810000607428700000004]
data.aws_iam_policy_document.cloudfront-access-policy: Read complete after 0s [id=3176184128]
aws_cloudfront_distribution.app-distribution: Refreshing state... [id=E27O84ZQ7XGWF1]
aws_s3_bucket_policy.app-bucket-policy: Refreshing state... [id=finances-app20220810000607428700000004]
aws_elastic_beanstalk_environment.api-env: Refreshing state... [id=e-pxixzq8imq]
aws_route53_record.app-record: Refreshing state... [id=Z101963012JKD45NDFGLP_finances-easy.co.uk_A]
aws_apigatewayv2_integration.api-integration: Refreshing state... [id=aeftdkh]
aws_apigatewayv2_route.default-route: Refreshing state... [id=ne5zuqo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_elastic_beanstalk_environment.api-env will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "api-env" {
        id                     = "e-pxixzq8imq"
        name                   = "finances-easy-api"
        tags                   = {}
        # (19 unchanged attributes hidden)

      ~ setting {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # aws_route53_record.api_validation will be created
  + resource "aws_route53_record" "api_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_27e0380d9f00f18ef4235494bd5485a0.api.finances-easy.co.uk"
      + records         = [
          + "_3e285df7c554626679fec3e55f41ec00.zxwlrjxpwn.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z101963012JKD45NDFGLP"
    }

  # aws_route53_record.api_validation["api.finances-easy.co.uk"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "api_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_27e0380d9f00f18ef4235494bd5485a0.api.finances-easy.co.uk" -> null
      - id              = "Z101963012JKD45NDFGLP__27e0380d9f00f18ef4235494bd5485a0.api.finances-easy.co.uk_CNAME" -> null
      - name            = "_27e0380d9f00f18ef4235494bd5485a0.api.finances-easy.co.uk" -> null
      - records         = [
          - "_3e285df7c554626679fec3e55f41ec00.zxwlrjxpwn.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z101963012JKD45NDFGLP" -> null
    }

  # aws_route53_record.app_validation will be created
  + resource "aws_route53_record" "app_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_bfe4c445de567ac98e890e38a846b964.finances-easy.co.uk"
      + records         = [
          + "_7057382d3f122ef506683434eb89c6a6.zxwlrjxpwn.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z101963012JKD45NDFGLP"
    }

  # aws_route53_record.app_validation["finances-easy.co.uk"] will be destroyed
  # (because resource does not use for_each)
  - resource "aws_route53_record" "app_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_bfe4c445de567ac98e890e38a846b964.finances-easy.co.uk" -> null
      - id              = "Z101963012JKD45NDFGLP__bfe4c445de567ac98e890e38a846b964.finances-easy.co.uk._CNAME" -> null
      - name            = "_bfe4c445de567ac98e890e38a846b964.finances-easy.co.uk" -> null
      - records         = [
          - "_7057382d3f122ef506683434eb89c6a6.zxwlrjxpwn.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z101963012JKD45NDFGLP" -> null
    }

  # aws_s3_bucket_versioning.app-versioning will be created
  + resource "aws_s3_bucket_versioning" "app-versioning" {
      + bucket = "finances-app20220810000607428700000004"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-uVp2coRQjr2HwoqT/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-uVp2coRQjr2HwoqT/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @alexandre3gomes, Action: `pull_request`*